// General
"Chameleon_title" = "Chameleon Bootloader";
"Chameleon_description" = "Chameleon requires three essential files. (in simple terms)
boot0 (On the drive's MBR) responsible for loading boot1.
boot1 (On the partition's boot-sector) to finding boot2.
boot2 (On the partition's root directory) for loading kernel etc.";

"Standard_title" = "Chameleon Standard";
"Standard_description" = "Κανονική εγκατάσταση του Chameleon.";

"EFI_title" = "EFI";
"EFI_description" = "Install Chameleon's files to the normally hidden EFI partition using either boot0 or boot0md depending on your system and without destroying any existing Windows installation if you have one.";

"noboot_title" = "Don't install the Bootloader";
"noboot_description" = "Useful if you only want to install the extra's.";

// Modules

"Module_title" = "Chameleon Modules";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file. ";

"AMDGraphicsEnabler_title" = "AMDGraphicsEnabler";
"AMDGraphicsEnabler_description" = "The GraphicsEnabler ATI code ( > r784) ported to a module.
This code has no support for 'legacy' ATI cards.
If your HD card was supported on the old code and you find
it missing on this, please file an issue at:
http://forge.voodooprojects.org/p/chameleon/issues/
The same applies to any missing card on this code.
Only cards known to work will be added.";

"ATiGraphicsEnabler_title" = "ATiGraphicsEnabler";
"ATiGraphicsEnabler_description" = "The GraphicsEnabler ATI code ( < r784) ported to a module.
Support for 'legacy' cards...
Based on Meklort's work.";

"IntelGraphicsEnabler_title" = "IntelGraphicsEnabler";
"IntelGraphicsEnabler_description" = "Enables a few Intel cards to be used out of the box, mostly mobile ones.";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "This module reads the edid information from the monitor attached to the main display.
The module is currently not integrated into trunk and has minimal uses as it stands.
Additionally, the module will patch the vesa modes available in pre intel hd graphics cards to provide proper resolution while booting.";

"NVIDIAGraphicsEnabler_title" = "NVIDIAGraphicsEnabler";
"NVIDIAGraphicsEnabler_description" = "The GraphicsEnabler nVidia code ported to a module.
If your card is supported and you find it missing on this code, please file an issue at:
http://forge.voodooprojects.org/p/chameleon/issues/
Only cards known to work will be added.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "This module permits the user to define the keyboard key mappings.";

// Utility
"Utility_title" = "Utilities";
"Utility_description" = "Optional files to help setup";

"PrefPanel_title" = "Preference Panel";
"PrefPanel_description" = "Installs Preference Panel for Chameleon.";

"SMBIOSDefault_title" = "SMBIOS.plist";
"SMBIOSDefault_description" = "Copies an example smbios.plist in /Extra/Configuration.";

"Documentation_title" = "Documentation";
"Documentation_description" = "Documentation for Chameleon manual install and use";

// Options
"Options_title" = "Επιλογές";
"Options_description" = "Ορισμός των αρχικών επιλογών";

"arch_title" = "arch=i386";
"arch_description" = "Boots the kernel in 32bit mode rather than the default 64bit mode.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Display the partition selection screen without showing the timeout screen.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Enable quiet boot mode (no messages or prompt).";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Disables the automatically enabled restart fix.";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Disables display of partition and resolution details.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Discard the motherboard's built-in SSDT tables.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Προσθήκη EthernetBuiltIn=y στο com.apple.Boot.plist. Αυτή η επιλογή θα προσθέσει το χαρακτηριστικό 'built-in' στους ελεγκτές δικτύου.";

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Προσθήκη GraphicsEnabler=y στο com.apple.Boot.plist. Αυτή η επιλογή θα αναγνωρίσει αυτόματα συμβατές κάρτες GPU βασισμένες σε NVidia και θα εισάγει στο σύστημα τις κατάλληλες πληροφορίες.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Enable specific Processor power state, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Enable specific Processor power state, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Enable specific Processor power state, C4.";

"SkipFTFix_title" = "SkipFTFix=Yes";
"SkipFTFix_description" = "A temporary work around for this breaking RAID booting.";

// Advanced
"Advanced_title" = "Advanced";
"Advanced_description" = "Select your advanced desired options to control Chameleon's settings.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Set the flag npci=0x2000 for the Kernel Flags";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Hides Chameleon's boot banner in GUI.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Use the legacy (grey on white) apple logo on the boot screen rather than the boot.png in the theme.";

"SMBIOSdefaults_title" = "SMBIOSdefaults=Yes";
"SMBIOSdefaults_description" = "Enables SMBIOSdefaults options.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Enables UseAtiROM options.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Enables UseNvidiaROM options.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pauses the boot process after Chameleon has finished it's setup then waits for a key press before it starts the mach kernel. Useful when combined with verbose boot for troubleshooting.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Attempts to load the sleep image saved from last hibernation.";

"GUI_title" = "GUI=No";
"GUI_description" = "Απενεργοποίηση γραφικού περιβάλλοντος. Αυτή η επιλογή θα προσθέσει 'GUI=n' στο com.apple.Boot.plist.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Enables VBIOS option";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Enable auto generation of processor idle sleep states (C-States).";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Enable auto generation of processor power performance states (P-States).";

"CSTUsingSystemIO_title" = "New - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "New C-State _CST generation method using SystemIO registers instead of FixedHW.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Προσθήκη ForceHPET=y στο com.apple.Boot.plist. Αυτή η επιλογή ενεργοποιεί το HPET σε Intel chipsets για τα BIOS που δεν έχουν αυτή την ρύθμιση.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Προσθήκη ForceWake=y στο com.apple.Boot.plist. Αυτή η επιλογή σας επιτρέπει να αγνοείτε bad sleep images.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Προσθήκη EHCIacquire=y στο com.apple.Boot.plist. Αυτή η επιλογή διορθώνει κάθε EHCI ownership issues due to bad bioses.";

"UHCIreset_title" = "UHCIreset";
"UHCIreset_description" = "Προσθήκη UHCIreset=y στο com.apple.Boot.plist. Αυτή η επιλογή θα κάνει reset τους ελεγκτές UHCI κάθε φορά πριν την εκκίνηση του OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Disables the automatically enabled RAM recognition.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Set keylayout to use";

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Use the keyboard layout for a German Mac keyboard";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Use the keyboard layout for a Spanish Mac keyboard";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Use the keyboard layout for a French Mac keyboard";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Use the keyboard layout for an Italian Mac keyboard";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Use the keyboard layout for a Swedish Mac keyboard";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Use the keyboard layout for a French PC keyboard";

// Resolution
"Resolution_title" = "Resolution";
"Resolution_description" = "Set the screen resolution of your display";

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "1920x1200x32";

// Themes
"Themes_title" = "Θέματα";
"Themes_description" = "Συλλογή δειγμάτων από θέματα
More themes can be found at http://forum.voodooprojects.org/index.php/board,7.0.html";

"Embed_title" = "Embed";
"Embed_description" = "A smaller simple version of the new default theme used when building a version of Chameleon which requires an embedded theme. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleon's previous default theme";

"Default_title" = "Standard";
"Default_description" = "Το θέμα που ήταν ενσωματωμένο στον booter, συμπεριλαμβάνεται εδώ για την δική σας τροποποίηση.";

// Extras
"Extras_title" = "Extras";
"Extras_description" = "Μια συλλογή χρήσιμων πρόσθετων";

"SMBios_title" = "SMBIOS Override";
"SMBios_description" = "Εισάγει στο σύστημα τις αρχικές παραμέτρους SMBIOS παρακάμπτοντας το αρχείο 'smbios.plist' στο φάκελο Extra.";

// Error strings
"ERROR_BOOTVOL" = "Αυτό το λογισμικό πρέπει να εγκατασταθεί στο διαμέρισμα εκκίνησης του δίσκου.";
"ERROR_INSTALL" = "Αυτό το διαμέρισμα δίσκου δεν πληροί τις προδιαγραφές για αυτή την αναβάθμιση.";

"Newer_Package_Installed_message" = "Μια νεότερη έκδοση του Chameleon είναι ήδη εγκατεστημένη.";
"Intel_Mac_message" = "Αυτό το λογισμικό δεν μπορεί να εγκατασταθεί σε αυτό τον υπολογιστή.";
